feat(ci, cli, core, ui): add code
